import itertools
import time

# কাস্টম ASCII লোগো
logo = """\033[32m
███╗░░░███╗██████╗░░░░
████╗░████║██╔══██╗░░░
██╔████╔██║██████╔╝░░░
██║╚██╔╝██║██╔══██╗░░░
██║░╚═╝░██║██║░░██║██╗
╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═╝

██████╗░███████╗██████╗░██╗████████╗
██╔══██╗██╔════╝██╔══██╗██║╚══██╔══╝
██████╔╝█████╗░░██████╦╝██║░░░██║░░░
██╔══██╗██╔══╝░░██╔══██╗██║░░░██║░░░
██║░░██║███████╗██████╦╝██║░░░██║░░░
╚═╝░░╚═╝╚══════╝╚═════╝░╚═╝░░░╚═╝░░░
"""
print(logo)

# ইউজারনেম ইনপুট
username = input("$ Enter Victim ID: ")

print(f"\n[*] Trying passwords for user '{username}'...\n")

# শুধুমাত্র সংখ্যা (0000-9999) চেষ্টা করবে
for guess in itertools.product("01234567890", repeat=8):
    guess = "".join(guess)  # নম্বর কম্বিনেশন তৈরি

    print(f"[*] Trying: {guess}")  # চেষ্টা করা পাসওয়ার্ড দেখানো
    time.sleep(0.1)  # প্রতিটি ট্রাইয়ের মাঝে সামান্য বিরতি (কম্পিউটার লোড কমানোর জন্য)
